{
    "TSLA": {
        "0": {
            "rate": "🔻-1.426533523537806%",
            "change_date": "2025-01-23/2025-01-24",
            "headline": "Baya Systems raises $36M for AI and chiplet innovation",
            "content": "Baya Systems, a chip technology company that wants accelerate intelligent computing, raised $36 million in funding. \r\nMaverick Silicon led the round, which also included strategic investment from Syn… [+9587 chars]"
        },
        "1": {
            "rate": "🔻-0.6620107667685189%",
            "change_date": "2025-01-22/2025-01-23",
            "headline": "Trump’s war on electric cars has only just begun",
            "content": "The EV tax credit is still alive and kicking but for how long? \r\nByAndrew J. Hawkins, transportation editor with 10+ years of experience who covers EVs, public transportation, and aviation. His work … [+6384 chars]"
        },
        "2": {
            "rate": "🔻-2.1584640215846354%",
            "change_date": "2025-01-21/2025-01-22",
            "headline": "Volvo announces pricing for delayed EX30 compact SUV",
            "content": "Volvo announces pricing for delayed EX30 compact SUV\r\nVolvo announces pricing for delayed EX30 compact SUV\r\n / The EX30 has been a bestseller in Europe, but was delayed in the US thanks to tariffs. \r… [+2522 chars]"
        },
        "3": {
            "rate": "🔻-0.5730186054189184%",
            "change_date": "2025-01-17/2025-01-21",
            "headline": "Tesla Batteries Burning in LA Wildfire Present an Irony About Sustainability",
            "content": "California sells more electric cars than any other state, many of which in Southern California have turned into rubble during the recent Los Angeles wildfires. And while lithium-ion batteries present… [+3431 chars]"
        },
        "4": {
            "rate": "🔺2.9730363423212207%",
            "change_date": "2025-01-16/2025-01-17",
            "headline": "Trump’s Transportation Nominee Claims He’ll Let the Investigation Into Musk’s Tesla Continue",
            "content": "President-elect Donald Trump’s nomination for U.S. Transportation Secretary has claimed that should he be confirmed, he will allow the department’s various probes into Tesla to continue.\r\nDuring a co… [+2439 chars]"
        },
        "5": {
            "rate": "🔻-3.479773814702053%",
            "change_date": "2025-01-15/2025-01-16",
            "headline": "Trump’s transportation pick says he’ll let Tesla investigations proceed",
            "content": "Trumps transportation pick says hell let Tesla investigations proceed\r\nTrumps transportation pick says hell let Tesla investigations proceed\r\n / Ex-Congressman Sean Duffy, who was nominated to lead t… [+4037 chars]"
        },
        "6": {
            "rate": "🔺7.440100882723836%",
            "change_date": "2025-01-14/2025-01-15",
            "headline": "SEC accuses Elon Musk of securities violation in new suit",
            "content": "AP/Noah Berger\r\n<ul><li>The Securities and Exchange Commission has filed suit against Elon Musk.</li><li>The new suit alleges Musk violated securities law.</li><li>It's not the first time the Tesla l… [+1527 chars]"
        },
        "7": {
            "rate": "🔻-1.7534564537289303%",
            "change_date": "2025-01-13/2025-01-14",
            "headline": "Elon Musk Promotes Video Claiming He Saved ‘Thousands of Lives’ From Wildfires",
            "content": "Elon Musk, the world’s wealthiest human being, has enormous resources at his disposal to provide relief for those struggling around the world. So when Musk saw the good people of Los Angeles enduring… [+7774 chars]"
        },
        "8": {
            "rate": "🔺2.12491631747291%",
            "change_date": "2025-01-10/2025-01-13",
            "headline": "Joe Biden’s national climate adviser sees AI as a ‘massive opportunity’",
            "content": "Joe Bidens national climate adviser sees AI as a massive opportunity\r\nJoe Bidens national climate adviser sees AI as a massive opportunity\r\n / National climate adviser Ali Zaidi is still optimistic a… [+11161 chars]"
        },
        "9": {
            "rate": "🔻-0.050666261336573086%",
            "change_date": "2025-01-08/2025-01-10",
            "headline": "Honda's Gorgeous 0 Series EVs Begin Production Next Year",
            "content": "Honda's 0 (Zero) series of electric vehicles returns to CES this year, graduating from concept to prototype and powered by new technology with a familiar name. The wedge-shaped 0 Saloon and 0 SUV are… [+4109 chars]"
        },
        "10": {
            "rate": "🔺0.14685775054438246%",
            "change_date": "2025-01-07/2025-01-08",
            "headline": "Meta Follows Elon Musk’s Lead, Moves Staffers to Billionaire-Friendly Texas",
            "content": "Executives are doing everything they can to create an environment conducive for actions they want to take, absent review or accountability from actors like our courts or legislators or others, she sa… [+3531 chars]"
        },
        "11": {
            "rate": "🔻-4.232173648443046%",
            "change_date": "2025-01-06/2025-01-07",
            "headline": "This Donut-Shaped Motor Could Change How EV Are Designed",
            "content": "The shape of the electric motor and, more importantly, the electric cars that they power may be about to change. At CES 2025, electric motor manufacturer Donut Lab rolled out its second-generation in… [+3600 chars]"
        },
        "12": {
            "rate": "🔺0.14840043790293483%",
            "change_date": "2025-01-03/2025-01-06",
            "headline": "Cybertruck explosion investigation identifies the driver and tracks its path to Las Vegas",
            "content": "Cybertruck explosion investigation identifies the driver and tracks its path to Las Vegas\r\nCybertruck explosion investigation identifies the driver and tracks its path to Las Vegas\r\n / Authorities sa… [+3434 chars]"
        },
        "13": {
            "rate": "🔺7.591852645940947%",
            "change_date": "2025-01-02/2025-01-03",
            "headline": "Tesla Sales Drop for First Time in Over a Decade While China’s BYD Rises",
            "content": "Teslas might be blowing up, but sales aren’t. Elon Musk’s car company released its annual sales figures for 2024, revealing that it delivered 1.79 millionjust under the 1.8 million that the company s… [+2716 chars]"
        },
        "14": {
            "rate": "🔻-6.475427125079099%",
            "change_date": "2024-12-31/2025-01-02",
            "headline": "The 'godfather' of AI is backing Elon Musk's lawsuit against OpenAI",
            "content": "\"Allowing it to tear all of that up when it becomes inconvenient sends a very bad message to other actors in the ecosystem,\" Geoffrey Hinton said of OpenAI's plan to become a for-profit company.Anna … [+2958 chars]"
        },
        "15": {
            "rate": "🔻-3.36024167987323%",
            "change_date": "2024-12-30/2024-12-31",
            "headline": "'Due for a full-blown correction': Why one CIO expects a 15% stock-market pullback early in 2025 — and how to prepare",
            "content": "As the year draws to a close, investors typically anticipate the so-called Santa Claus rally a phenomenon where stocks get a boost in the final days of December and the beginning of January.\r\nHowever… [+3906 chars]"
        },
        "16": {
            "rate": "🔻-3.413909585299825%",
            "change_date": "2024-12-27/2024-12-30",
            "headline": "Hertz Continues EV Purge",
            "content": "Funny, I have had a $156k Model X P100D since 2018, and bought a $157k Model X Plaid in 2022.The fact that I wake up just about every day with a full tank of gas, charged off my house's Solar for the… [+307 chars]"
        },
        "17": {
            "rate": "🔻-5.205485799008472%",
            "change_date": "2024-12-26/2024-12-27",
            "headline": "BYD makes much more than cars. These 5 side hustles also helped turn the Chinese EV giant into a challenger to Elon Musk's Tesla.",
            "content": "BYD has rapidly become one of the world's largest sellers of EVs.INA FASSBENDER/AFP via Getty Images\r\n<ul><li>BYD is chasing down Tesla on EV sales, but the Chinese giant is much more than just a car… [+4711 chars]"
        }
    }
}